{"published": "2015-09-25T04:41:56Z", "media-type": "News", "title": "High school girls volleyball: Woodland saves 4 match points, beats Inderkum, 3-2", "id": "ea5e5e46-2329-4bf6-a792-5178a057610c", "content": "There were few if any illusions for the Woodland High School girls volleyball team as they headed to Inderkum Wednesday night. \n\n“(Wednesday) I know going to Sacramento would be a difficult task,” Wolves head coach Idelle Nicdao said. “I know their players are tall and very, very physical. Most of their front row players are about 6-feet tall and very, very physical and very athletic ladies.” \n\nSo it was no surprise when the Wolves ended up playing their second-straight, five-set match. It was the way they outlasted the Tigers for the 25-19, 19-25, 23-25, 27-25, 15-9 Tri-County Conference victory that was special. \n  \nWoodland (4-1, 2-0 TCC) trailed Inderkum two sets to one and 24-20 in the fourth set, but rallied behind two kills from outside hitter Jessica Baker and a key tip and block from middle blocker Liz Luchessi to win the set. \n\nBaker (26 kills, six digs) and Killion Newsom (14 kills) controlled the final set for the Wolves, who have taken the early TCC lead as the only school without a league loss. \n\nInderkum, which owns tournament wins over Davis and Pioneer, fell to 1-2 in the TCC. \n\n“Our gameplan was to minimize their middle attack,” Nicdao said. “We were very successful in the first set and in the second set they made a good adjustment.” \n  \nUltimately X’s and O’s were less important for the Wolves than was their inner fortitude. \n\n“(Before the fourth set) I told the girls to play smarter and we need to bring our mental toughness on every attack and every reception and minimize our errors,” Nicdao said. \n\nLuchessi finished with 10 kills and five solo blocks. Setter Cassidy Schreiner, one match after setting a school record with 52 assists, had 48 assists, six service points and an ace against the Tigers. \n\nNatalie Butterfield had 15 digs, two aces and eight service points, Sam Ibbetson had five blocks and four kills and both Shaye conley and Tori Maichel were 14 for 15 serving. \n  \nWoodland plays at home Monday against TCC rival Rio Linda. Game time is 6 p.m.", "source": "Woodland Daily Democrat"}