{"published": "2015-09-18T09:48:00Z", "media-type": "News", "title": "As ZANU PF decorates 2018 manifesto", "id": "5a8f595b-d862-4760-8e92-6b86b62dbd7f", "content": "The revolution that has reined change by arresting the rot and ever growing hackling of corporate governance by big wigs in various state companies countrywide cultivates ground work and forges the political will in the matrix of luring foreign direct investment. \nInterventions by the Office of the President and Cabinet at the apex of Zimbabwe's political realm to push for the enactment of the Public Sector Governance (PSG) bill into law marks the genesis of practical steps in implementation of turnaround strategies towards resuscitating the economy. \n\n\r\nWhat is most laudable about the developments is the final realisation that our institutions are top heavy therefore the onslaught on employees was somewhat misdirected perhaps as a result of the inconsiderate management. Again it is noble to applaud the government for halting the wily nilly job losses. \n\nHowever, the new gist advocated by the PSG bill to audit lifestyle and maintain constant reviews on the performance of chief executives of state institutions should come with practical purges given most of the big wigs are incompetent as evidenced by the poor performance of the entities they are heading. \n\n After introducing the same system in China, the Chinese Communist Party's anti-corruption agency (Central Commission for Discipline Inspection) arrested and punished about 182,000 Chinese officials in 2013. The situation is a reverse of what transpired locally where instead the mere employees were send packing. \n\nThe equilibrium was only balanced at Harare City Council where the paradigm shifted exposing the anomaly of big wigs planning to axe employees as a way of cutting down the wage bill while they are awarding themselves obscene benefits and salaries. \n\nHollow effects left by this type of management, go beyond the workers misfortunes but literary translated to the scaring away of potential investors. Even loads of rubble and rubbish cannot fill the corporate hole. What more of money? Certainly there couldn't be any sane person to throw their money in such a bottomless. \n\nThus the decentralization of powers, where permanent secretaries can no longer sit on public boards promotes transparency. The permanent secretary functions as an accounting officer to then have him or her sit on a public board only pose the question who will keep the keeper? \n\nThe prescription of the bill also states that contracts renewal for chief executives will be based on performance thereby increase competition on service delivery which again translates to the justification of the tax payer's money and increased beneficiation. \n\nIdeally the OPC has come in practical, especially when big investors such as Aliko Dangote have presented themselves on our doorsteps as a nation. The fruition of the intervention then becomes of paramount importance which would be used as yardstick by the electorate in 2018. \n\nHopefully the opposition, MDC-T in particular is taking notes as ZANU PF is busy crafting and decorating their 2018 manifesto. This is to avoid the talk of 'we have a very broad base of supporters but we lost' based on unfounded complacency. \n\nInasmuch as election mood is counter development, ZANU PF has a way of managing it which I believe is political maturity. The revolutionary party peels self and emerges invigorated at the end of the day. What we then have from the other side is heaps and heaps of petitions, human rights activism and globetrotting solely to smear mud on government with the hope a military invasion on Zimbabwe. I did say military invasion because the West's sympathy hasn't worked anyhow. \n\nLet us then have MDC-T and a whole lot of other political parties bring their Dangotes breaking new ground as far as responsible politics despite different social, ethnical and political background is concerned as President Mugabe reiterated at the opening of the 8th session of Parliament. \n\nConclusively the bill stipulates that 'no rewards for no results', ironically there will not be votes for no results in 2018. MDC-T needs to wary, like I alluded to earlier that election mood isn't healthy for a nation but let me hasten mention that so far the opposition have no reason on the table to convince the electorate. \n\nAnother ZANU PF re-election will not come as a surprise under such circumstances. \n \nAll articles and letters published on Bulawayo24 have been independently written by members of Bulawayo24's community. The views of users published on Bulawayo24 are therefore their own and do not necessarily represent the views of Bulawayo24. Bulawayo24 editors also reserve the right to edit or delete any and all comments received.", "source": "Bulawayo24 News"}