{"published": "2015-09-08T11:24:20Z", "media-type": "News", "title": "German army to scrap G36 rifle from 2019", "id": "a4d72da3-08cf-43b4-a3c8-223384fd17d8", "content": "Soldiers with the G36. Photo: DPA \n\n Defence Minister Ursula von der Leyen announced on Tuesday that the government will scrap the G36, the Bundeswehr's (German army) standard rifle, following revelations about serious defects in its accuracy. \n \n\"We've decided to make a clear break and we did this in agreement with the military hierarchy,\" said the Christian Democratic Union (CDU) politician. \n \nVon der Leyen announced at the start of April that the G36, made by Heckler and Koch, had no future in its current form in the Bundeswehr due to the fact that it lost accuracy at high temperatures and during sustained fire. \n \nBut it remained unclear whether the 167,000 G36 assault rifles which the Bundeswehr currently relies upon as standard issues weapons for soldiers would be scrapped or upgraded. \n \n\"After almost 20 years with the G36, we want a new generation of rifles for the army,\" von der Leyen said of the decision. \n \n\"The new weapon should meet modern requirements and be an improvement on the G36. There will also be an open and transparent application process for the contract,\" she said. \n \nBut a spokesperson for the defence ministry told The Local that the army will continue to use the G36 even after 2019, the date that the ministry has penciled in for the first batch of new weapons to be delivered. \n \n\"It is not a case of taking the 167,000 weapons and replacing them with 167,000 of the new weapons from one day to the next,\" he said. \n \n\"Up until 2019, when a G36 breaks we will replace it with a G36. Only from 2019 will we start to replace it with the new weapon,\" he added. \n \nBut he emphasized that even after this point some Bundeswehr soldiers would still be using the old weapons. \n \n\"In 2020 soldiers will still be using the G36,\" he said. \n \nThe spokesperson refused to comment on what would happen with stocks of the old assault rifle after this point, particularly whether the weapon would be sold on or be destroyed. \n \n\"I can't see into a crystal ball, but I can say from experience that I don't think many will be in working order by this point,\" he said. \n \nThe scandal around the Bundeswehr's standard-issue weapon began in the spring when  rumours about accuracy problems  in hot conditions or when the weapon had been used for sustained fire surfaced in the media. \n \nMedia reports then emerged suggesting Heckler and Koch had asked Germany's military counterintelligence agency (MAD) to  prevent reports about the problems with the weapon from being published  - with backing from defence ministry officials. \n \n The defence ministry also announced in August that 600 assault rifles of the type G27P and 600 light machine guns have been ordered for front line soldiers in the interim period.", "source": "The Local Germany"}