{"published": "2015-09-10T12:00:00Z", "media-type": "Blog", "title": "BioMark Diagnostics to Conduct Validation Studies for Its Patented Assays in Patients With Lung Cancer", "id": "7730cd19-bf12-480d-9e58-5b2be5ec6a33", "content": "VANCOUVER, British Columbia, Sept. 10, 2015 /satPRnews.com/ — BioMark Diagnostics Inc. (“BioMark”) (CSE:BUX) (FSE:20B) (OTCQB:BMKDF) announces that it expects to begin conducting studies in the fourth quarter of 2015 to validate the use of its patented assays to determine response to surgical intervention for patients with lung cancer, and to further offer a personalized and reliable indicator to monitor persistence, recurrence, or state of a tumour. Dr. James Bond, Chief of Surrey Memorial Hospital Thoracic Surgery Team, along with the entire thoracic surgical division of Fraser Health Authority that includes Drs. Ahmad Ashrafi, Sharon Ong, and Kyle Grant, will serve as principal investigator for this formative clinical validation study entitled “The use of BioMark’s Acetyl Amantadine patented technology to assess surgical intervention for lung cancer.”   Fraser Health Authority is one of the largest, fastest growing health care authorities in Canada serving a population of 1.8 million encompassing 12 regional hospitals.  It has the largest and busiest thoracic surgery program in British Columbia . In addition, Dr. Daniel Sitar of CancerCare Manitoba will also act as co-principal investigator. President and CEO of BioMark Rashid Ahmed stated, “Lung cancer is the most devastating cancer with very low five-year survival rates. Having access to an effective, non-invasive means of assessing and monitoring this cancer would be highly beneficial for this group of patients. We believe that our assay could offer a valuable diagnostic tool for surgical oncologists to assess the clinical success and potential recurrence of cancer. We are honored to have Dr. Bond and the distinguished team at Surrey Memorial Hospital working with us. We expect to begin this trial in the fourth quarter of 2015, subject to ethics approval from Fraser Health Authority.” Dr. Bond says, “At present, we have numerous diagnostic modalities to facilitate the diagnosis and staging of lung cancer. Each of these current modalities is expensive, at risk of false negative results (that is, will miss a cancer diagnosis), has long waitlists to gain access to these tests and, in the end, requires a specialist (thoracic surgeon) to put all the details together to then plan for treatment. Surgery is still the most important part of cancer cure therapies. Under our current paradigm of care, an interventional procedure is most often used to acquire tissue to confirm a diagnosis. This might mean a bronchoscopy or a lung biopsy performed in the radiology department. As lung biopsies are frequently non-diagnostic, as are bronchoscopies, many of these tests serve to delay definitive treatment while also costing the health care System an immense amount of money for results that are not helpful. “A urine or blood test used to diagnose lung cancer, and then used again to monitor for recurrence after treatment, has the potential to radically change how we diagnose, and then treat, lung cancer. A urine or blood test will be substantially faster, saving weeks or even months searching for a diagnosis. It will expedite referral to a surgeon or other specialists directly from the general practitioner after a positive blood test. This will result in faster access to curative treatments. As a urine or blood test will have significantly lower costs and without the risk of complications of other tests such as bronchoscopies and lung biopsies, the health care System can redirect those savings where they might be more needed. “Simply put, a urine or blood test for lung cancer will save lives, will save time, and will save health care dollars. The need for such technologies cannot be overstated. This is an important study with far-reaching implications for lung cancer and other cancers as well,” added Dr. Bond. About Dr. James Bond Dr. Bond is a healthcare innovator with a track record of overcoming inertia and streamlining processes. At Surrey Memorial Hospital, he has led a Rapid Autopilot Program (RAP) to speed up lung cancer wait times from an average of 190 days to 45 days. When a patient receives abnormal lung imaging, he/she is immediately appointed a nurse navigator, who is responsible for planning his/her care and sending imaging to the surgeon for his insight. Dr. Bond is an innovative thoracic surgeon, who has led the adoption of the MATRIX thoracic surgical procedure and created a comprehensive program of care at Surrey Memorial Hospital that is the only one of its kind in Canada . The innovative surgery improves survival rates, reduces lengthy hospital stays and improves long-term outcomes by mitigating chronic pain and breathlessness. Dr. Bond currently trains other doctors in North America on the procedure. About BioMark Diagnostics Inc. BioMark Diagnostics is developing proprietary, non-invasive, and accurate cancer diagnostic solutions, which can help detect, monitor and assess treatment for cancer early and cost effectively. The technology can also be used for measuring response to treatment and potentially for serial monitoring for cancer survivors. Further information about BioMark Diagnostics is available under its profile on the SEDAR website www.sedar.com and on the CSE website www.thecse.ca . Forward-Looking Information This press release may include forward-looking information within the meaning of Canadian securities legislation, concerning the business of BioMark. Forward-looking information is based on certain key expectations and assumptions made by the management of BioMark. Although BioMark believes that the expectations and assumptions on which such forward-looking information is based are reasonable, undue reliance should not be placed on the forward-looking information because BioMark can give no assurance that they will prove to be correct. Forward-looking statements contained in this press release are made as of the date of this press release. BioMark disclaims any intent or obligation to update publicly any forward-looking information, whether as a result of new information, future events or results or otherwise, other than as required by applicable securities laws. The CSE has not reviewed, approved or disapproved the content of this press release. Company Contact \nRashid Ahmed Bux \nPresident & CEO \nBioMark Diagnostics Inc. \n604-282-6567 \n \nInvestor Contact \nLHA \nJody Cain \n310-691-7100 \nSource: Globenewswire Public \n BioMark Diagnostics to Conduct Validation Studies for Its Patented Assays in Patients With Lung Cancer", "source": "Satellite News"}