{"published": "2015-09-08T07:43:44Z", "media-type": "News", "title": "Up to 30,000 Britons are eligible to claim compensation after Spanish government was forced to change 'unfair' inheritance tax laws on holiday homes", "id": "c4a1f668-b653-45d9-a95a-bb692c3e81cb", "content": "Britons unfairly charged IHT between 2011 and 2014 Specialist firm says thousands are due compensation But it claims making a case is 'fiendishly complicated' without help  \nUp to 30,000 Britons with holiday homes in Spain could still be due compensation from its government after they were hit with 'unfair' inheritance tax charges. \n\nThe punitive tax charge was made between 2011 and 2014 on non-residents – which in Spanish law is those who live there for less than half the year – who inherited a home. This included husbands and wives whose spouses died.  \n\nThe redress is expected to run into millions of euros for those hit. According to estimates by specialist solicitors Spanish Legal Reclaims after analysing government data, around 30,000 paid tax in the three-year period. \n   \nUnfair tax: Those who faced an IHT bill on their Spanish holiday home during 2011-14 are entitled to compensation. Pictured, Andalucia in southern Spain \n\nThe tax charge was in many cases up to a third of the property's value and it varied between regions. \n\nIt can only be reclaimed by EU citizens after the Spanish government hastily changed its IHT law after the European Court of Justice ruled the legislation - which exempted residents from the charge - was discriminatory. \n\nThe ruling was made last September but it is believed thousands still haven't got the ball rolling with compensation - despite there being a five year limit to put a claim in.  \n \nClaims typically take between six to eight months to process once they've been filed and the first glut of compensation is now being paid out. \n\nUnder the law, between 2011 and 2014 Spanish residents were exempt from up to 99 per cent of the tax charge depending on region, while homeowners with a property there had to pay the full amount within six months of inheriting. \n\nWith more Britons owning holiday homes in the sun in Spain than any other nationality, UK citizens were disproportionately affected. \n\nThey include Joan Ridsdale, a 62-year-old payroll administrator from County Durham who was hit with a €16,000 tax bill when her husband Gordon died. The couple owned a two-bedroom bungalow in the coastal resort of Almeria. \n\nMrs Ridsdale was forced to cash in her life savings to pay the charge and has since sold the property. \n\nThe Spanish authorities are now being forced to repay the inheritance tax paid by non-residents like Mrs Ridsdale. \n\nShe was one of the first to receive compensation from the Government earlier in the year. \n\nThe average repayment is €25,000, according to Spanish Legal Reclaims, a Barcelona-based law firm which specialises in helping non-residents to reclaim overpaid tax. \n   \nEU ruling: Last year, EU said the Spanish Government had acted unfairly - and people can claim redress \n\nLuis Cuervo, chief executive of Spanish Legal Reclaims, said: 'Losing a loved one is hard enough, but to then receive an unfair tax bill rubs salt in the wound. Yet for years this is what happened to thousands of Britons inheriting holiday homes in Spain. \n\n'Spain's authorities have agreed that non-residents who inherited a Spanish property during the past four-and-a-half years can claim back the tax they paid – but doing so is a complex and daunting task, as there is no single form to fill in. \n\n'Inheritors can only claim once, so it's essential they seek expert legal advice to ensure they get it right first time. \n\n'Spanish Legal Reclaims is representing 1,000 families from across the EU who find themselves in this position, and since the ECJ's landmark ruling our firm has had a 100 per cent success rate, securing a full refund of tax in every case.' \n\nBritons account for a substantial part of the law firm's business, it says.  \n\nThe largest refund it secured for a British client was €94,000, the smallest €4,400. \n\nHowever, it takes a large 35 per cent chunk of any compensation on a 'no win, no fee' basis. \n\nMrs Ridsdale used the firm to handle her case – it secured a full refund of her €16,000 tax bill, plus €700 in back interest from the Spanish taxman.  \n\nBut, with the fees, she was left with just under €11,000. \n\nThe firm says it is possible for British holiday homeowners to reclaim the tax themselves, but it is 'fiendishly difficult'. \n\nThey need to work out whether they can claim and then the process involves filling in multiple forms and making your case in court, which is all in Spanish.  \n\nHomeowners only get one attempt to lodge a compensation bid. \n\n ", "source": "Mail Online UK"}