{"published": "2015-09-08T08:55:08Z", "media-type": "News", "title": "DFAT helps Vic girl stranded in Vietnam", "id": "fddb0ec2-befb-4786-9522-23ac70fb5c7d", "content": "An 11-year-old Melbourne schoolgirl stranded in Vietnam without a passport is one step closer to coming home after the foreign affairs department stepped in to help her distraught mother. \n\nThe Maidstone schoolgirl - who cannot be named for legal reasons - has been stuck in Vietnam since late August after her father refused to hand over her passport before he flew to Melbourne, according to the girl's mother. \n\nThe issue was brought to the attention of Foreign Minister Julie Bishop on Tuesday and she has given assurances the Department of Foreign Affairs and Trade (DFAT) is dealing with the matter. \n\nSocial justice campaigner Les Twentyman, who has been helping the mother, says it is a positive outcome. \n\n\"Hopefully, within the next 24 or 48 hours, mum will be able to go over and bring her back,\" Les Twentyman told AAP. \n\nThe girl has been staying with her mother's relatives in Ho Chi Minh City after the 31-year-old flew back to Melbourne to track down her former husband and get a new passport for their daughter. \n\nThe couple have been separated since April but the family travelled to Vietnam together in July to visit relatives. \n\nThe woman's former husband said he would hold the family's passports for safekeeping but later told his ex-wife they had been stolen. \n\nAfter several attempts to contact him again, she said she went to the Australian embassy and was issued with another passport. \n\nBut embassy staff said the daughter's passport could not be reissued without the father's signature. \n\nThe mother has contacted Victoria Police to help find her husband, who she says is in Melbourne. \n\n\"My ex-husband remains elusive and unavailable and is not at all co-operative in assisting me to have our daughter return to Australia,\" the mother told DFAT in a letter. \n\nMr Twentyman said the department has agreed to waive the passport replacement forms so the 11-year-old can come home as soon as possible.", "source": "Prime 7"}