{"published": "2015-09-05T18:41:03Z", "media-type": "News", "title": "Festivals celebrating garlic held across Canada", "id": "2d1c35ba-800c-4390-a6f8-9a93b9554c02", "content": "TORONTO -- Lovers of the \"stinking rose\" will have plenty of opportunities to sample its pungent delights during festivals devoted to garlic. \n \nVisitors may be surprised to learn there are dozens of strains of garlic and that the cloves can be used in both savoury and sweet dishes. \n \nTwenty chefs will be on hand at the fifth Toronto Garlic Festival , set for Sept. 20, to concoct such dishes as savoury garlic ribs and roasted corn with garlic butter. \n \n\"We also have some more things that will challenge the palate,\" says festival founder Peter McClusky. \n \n\"For example, we do garlic and dessert items. People are always surprised by this and raise an eyebrow. They're always happily surprised when they taste it.\" \n \nA chocolatier is creating a dark chocolate truffle with black garlic. \n \n\"Black garlic is fermented garlic. It has kind of a tarry texture. It's got a flavour like licorice or coffee, chocolate, very dark deep flavour,\" says McClusky, who grows eight strains of garlic on a farm east of Guelph, Ont. \n \n\"It's got a sweetness to it, so it works really well not only in savoury things but dessert items.\" \n \nCaramelization occurs when garlic is roasted, releasing its sweeter, more mellow elements. \n \nOther sweets include macarons with roasted garlic, toasted homemade marshmallows with black garlic, roasted garlic chocolate ice cream -- which always sells out, McClusky notes -- and black garlic butter tarts. \n \nMeanwhile, visitors to the ninth Stratford Kiwanis Garlic Festival , running Sept. 12-13, may be tempted by black garlic chocolate brownies, garlic fudge and garlic ginger cookies. \n \nThe Stratford event started because the Ontario garlic crop was being hit hard by the import of Chinese garlic and many farmers were struggling, says co-ordinator Teresa Renee. \n \nThe crop is recovering, thanks in part to awareness raised by the festival and the eat-local movement. \n \nVisitors to both festivals, which are each expected to welcome about 5,000 attendees, will be able to stock up on their winter's supply of fresh garlic, along with condiments, jellies, pestos and other specialty items infused with garlic, and can watch cooking demos and presentations on health and wellness. \n \nOnce you've indulged in garlicky food, consider entering the garlic breath contest at the Toronto festival. \n \nThe Ontario Science Centre will rate the breath of contestants using a gas chromatograph, which measures parts-per-billion of hydrogen sulphide, methanethiol and dimethyl sulphide. \n \nIn Stratford, Renee says there will be a demonstration that allows people to understand that different types of garlic can change the flavour of food because some are hot and spicy while others are mild. She'll have some imported garlic on hand for people to compare. \"Chinese garlic is watery and flavourless, in my opinion,\" she says. \n \nAttendees can also learn what steps to take during the growing season to prepare garlic for braiding, then take part in a competition. \n \nOther communities in Ontario as well as B.C., Quebec and Alberta celebrate garlic. Coming up are the Verona, Ont., festival this Sunday and the Hills Garlic Festival in New Denver, B.C., on Sept. 13. \n \nIn Andrew, Alta. , an hour's drive northeast of Edmonton, the 400 residents there welcome more than 1,000 people to their annual festival on Thanksgiving weekend, which will include a garlic peeling contest, an \"Amazing Garlic Race,\" a country hoedown and barbecue and, in a nod to the community's Ukrainian roots, a perogy dinner.", "source": "Daily Herald Tribune"}