{"published": "2015-09-08T11:26:59Z", "media-type": "Blog", "title": "In September 2015, people still order from GAME and expect good service", "id": "a7658412-b23a-43a0-ac8c-0bcfc2e6fde5", "content": "In the latest in a long line of mess ups from the company, that included losing a truckload of colorful squids, it is now being  widely reported that UK retailer GAME have dramatically screwed up pre-orders of Super Mario Maker for thier customers. The issue is a much bigger hassle this time than simply canceling a valid preorder – which seems to be their usual mistake to make nowadays – instead they are charging customers up to seven times for a single copy of a game – that’s £328.93 for a single copy of Super Mario Maker. \n \nA quick glance at Twitter shows the follow… \n \nHmm got 5 emails from GAME about my order of Super Mario Maker, according to sites this means I might have got charged 5 times. lol awesome. \n \n— Jason Darby (@JasonDarby) September 7, 2015 \n \n\n \n@eurogamer GAME have charged me 4x for Super Mario Maker, anyone else with this problem? \n \n— Ragonkai (@Ragonkai) September 7, 2015 \n \n\n \nAny reason why you've charged me 4 times for my Mario Maker Limited Edition bundle?! @GAMEdigital \n \n— «♪.Dana » (@mycactusandme) September 7, 2015 \n \n\n \n@GAMEHelps hi, I believe I am being charged 3 times for my order of Super Mario Maker, even though the quantity is only for 1 \n \n— Jamie (@HaYl064) September 7, 2015 \n \n\n \nOthers on Twitter are panicking, and accusing GAME of “ stealing ” their money. Obviously this is not the case, and the company will have to rectify their error and refund customers. However, that has not stopped some individual accounts to go overdrawn. This can be a tad more serious than a temporary charge appearing, as even when GAME rectify the error, some banks can still go on to fine customers for letting their accounts fall into that state. \n \nFor example,  Barclays cite the following fines will be issued for an overdrawn account. “ We refuse a payment from your account because there is not enough money in your account. (Fine – £8) ” \n \nGAME’s official Twitter support comments “ Hello, all. The GAME Team have investigated the issues surrounding orders of Super Mario Maker. Said issues will be resolved within 24 hours. Apologies once again and thank you for your patience. ” \n \nGame will go on to try and sell more games over the course of 2015. What will happen then? Nobody Knows !", "source": "DarkZero"}