{"published": "2015-09-09T12:00:00Z", "media-type": "News", "title": "Calyx's Subsidiary Cannigistics Announces Platform Licensing Agreement", "id": "61eb90c8-6dae-40de-86a6-a045e0d92d85", "content": "VANCOUVER, BRITISH COLUMBIA -- (Marketwired) -- 09/09/15 -- . (TSX VENTURE: CYX) (\"Calyx\" or \"the Company\") is pleased to announce that its wholly-owned subsidiary, Cannigistics Agri-Solutions Corp. (\"Cannigistics\"), has signed a multi-year agreement with TA Management Ltd. ('TAM\"), under which Cannigistics' platform will be used to run TAM's IT infrastructure strategy. By implementing its cloud server platform and compliance operating console, Cannigistics will provide TAM a sophisticated and modern IT platform in which to aggregate, host and manage their infrastructure. Under the agreement, Cannigistics will also provide ongoing support services. TAM, a wholly owned subsidiary of TA Global Berhad, was formed as a management services company and the property manager for FortisBC Centre (previously known as Terasen Centre), a 24-storey office tower in Vancouver acquired by the TA Group in 1995. \n\nThe implementation is being conducted in stages under which Cannigistics' software and information technology will be integrated with various elements of TAM's operations. The Cannigistics platform provides a management interface that can bring together disparate systems into one console, thus improving capabilities and visibility across all key aspects of the business. Cannigistics has already commenced the rollout and implantation with TAM, and expects the initial phase to be completed by the end of September. \n\n\"We are excited to have commenced our first implementation in a new vertical,\" said Roger Forde, President and CEO of Cannigistics. \"This is a highly important event, as it demonstrates how Cannigistics' platform is versatile enough to easily adapt to other markets. Our software tools and services enhance efficiencies across various areas of business in different commercial environments, and we are now positioned to aggressively pursue opportunities beyond our initial focus of indoor agriculture. We look forward to demonstrating this with TAM, and being part of their long term growth strategy.\" \n\n\"The Cannigistics platform will be a significant enhancement to our existing IT infrastructure\" said Craig Mah, Accounting Manager of TAM. \"The higher degree of control, redundancy, and ease of use this implementation brings will allow us to gain efficiencies in multiple areas of our business.\" Calyx's wholly-owned subsidiary, Cannigistics Agri-Solutions Corp, is a software development company that has created a software platform tailored to advanced indoor agriculture. The Cannigistics software platform is designed to enhance the efficiency and effectiveness of indoor agricultural operations, and positions Cannigistics to be the industry leader in agri-software solutions by providing businesses with advanced controls over all aspects of their operations. Additionally, Calyx owns a portfolio of proprietary intellectual property with applications in crop enhancement. \n\nON BEHALF OF THE BOARD OF DIRECTORS \n\nRoger Forde, Director, President and Chief Executive Officer \n\nForward-Looking Statements: This document contains certain forward-looking statements concerning Calyx, as well as other expectations, plans, goals, objectives, information or statements about future events, conditions, or performance that may constitute \"forward-looking statements\" or \"forward-looking information\" under applicable securities legislation. Such statements or information involve substantial known and unknown risks and uncertainties, certain of which are beyond Calyx's control. Such forward- looking statements or information are based on a number of assumptions, which may prove to be incorrect. \n\nAlthough Calyx believes that the expectations reflected in such forward-looking statements or information are reasonable, undue reliance should not be placed on forward-looking statements because Calyx can give no assurance that such expectations will prove to be correct. Forward-looking statements or information are based on current expectations, estimates and projections that involve a number of risks and uncertainties which could cause actual results to differ materially from those anticipated by Calyx and described in the forward-looking statements or information. \n\nThe forward-looking statements or information contained in this news release are made as of the date hereof and Calyx undertakes no obligation to update publicly or revise any forward-looking statements or information, whether as a result of new information, future events or otherwise unless so required by applicable securities laws or the TSX Venture Exchange. The forward-looking statements or information contained in this news release are expressly qualified by this cautionary statement.", "source": "Wall Street Select"}