{"published": "2015-09-08T17:32:06Z", "media-type": "News", "title": "Mexico vs. Argentina 2015: TV Channel, Time, Live Stream Info For Texas Friendly", "id": "8b6032bf-7de2-4af0-86ae-9a06683737a2", "content": "After a shaky 3-3 draw with Trinidad and Tobago, new Mexico interim coach Ricardo “Tuca” Ferretti will have just cause for trepidation leading his team into a meeting with an Argentina side fresh from a 7-0 destruction of Bolivia. In their first match since their Gold Cup triumph and the subsequent dismissal of coach Miguel Herrera’s, Mexico showed familiar failings against Trinidad in Utah. And the test promises to be tougher, still, against Lionel Messi and Argentina at AT&T Stadium in Arlington, Texas, on Tuesday night. \n \nFerretti, though, is adamant his team won’t be intimidated going up against a star-studded lineup. \n \n“We should not worry about them, we must know that they have talent and ability, but we must recognize our own,” he said in his pre-match press conference, per the Mexican Football Federation . \n \n“We are not going to go play with our legs trembling. When we have the ball we will try to do our part, we will look to attack, knowing how to defend well and offend properly, I have no fear, and I don’t think my players do. there is a respect , yes, as there is for anyone, but we don’t make any team greater or lesser.” \n \nTwo months on from Mexico twice throwing away leads in a topsy-turvy 4-4 draw with Trinidad in the Gold Cup group stage, on Friday it was El Tri who had to come back to snatch something from the match. Having fallen 2-0 behind before the 40th minute, a Carlos Esquivel header and an own goal got Mexico back level before a late wonder goal from Hector Herrera was required to avoid defeat. Still, it was an unfamiliar lineup put out by Ferretti, and there promises to be plenty of changes on Tuesday. Herrera, center-back duo Héctor  Moreno and Rafa Márquez , as well as Javier “Chicharito” Hernández  are some of those likely to be in from the start against Argentina. \n \nFerretti has been keen to point out that the result ultimately matters little in Texas, with the focus firmly on next month’s Confederations Cup playoff against old foes the United States at the Rose Bowl. It is the match for which Ferretti was appointed on a short-term basis following Herrera’s dismissal after getting involved in an altercation with a commentator. \n \nStill, the Brazilian-born Ferretti, who is combining the role with continuing to coach Tigres, will be wary of suffering the sort of morale-sapping defeat Argentina inflicted on their last opposition. Argentina went into the match with Bolivia fresh from the disappointment of an agonizing defeat in the final of a major tournament for a second successive summer -- their World Cup near-miss against Germany having been followed up with a penalty shootout loss to Chile at the Copa America. \n \nBut ahead of the start of South America’s grueling World Cup qualifying campaign, Argentina were devastating last Friday in Houston. Manchester City striker Sergio Agüero was the star, bagging two goals and laying on a trio of assists. One of those creations was for Lionel Messi, who scored twice himself, despite only coming on as a 65th minute substitute. \n \nIt was a welcome performance for Messi after he faced intense criticism back in his homeland for what was perceived as him again failing to perform in a major final with the same brilliance he displays regularly at club level. But club and international teammate Javier Mascherano has stated that it is simply a matter of Argentina adapting to Messi’s strengths in the way that Barcelona do. \n \n“When you have a player like Leo we have to adjust to his movements,” he told ESPN Deportes . “The movements have to be according to how he moves. You can't put him in one box in one place, he would keep giving you things but you would lose so many others. Our movement has to be based on where he goes. \n \n“Our intelligence is in knowing how to occupy the spaces in important moments and take advantage of that. Even more so than how is Leo as a player we have to give him the tools so we can see the best version.” \n \nKickoff time: 10 p.m. EDT \n \nTV channel: ESPN2, UniMás, Univision Deportes \n \nLive stream: Watch ESPN , Univision.com", "source": "International Business Times"}