{"published": "2015-09-11T14:00:04Z", "media-type": "News", "title": "Where is the case for raising interest rates?", "id": "aac6a1fc-4e31-459f-b048-a01360c3d12a", "content": "For months, there has been speculation and market hype over the timing of an interest rate hike by the Federal Reserve (affectionately known as the \"Fed\"). For months, in fact for the past year, we've been saying, \"It ain't happening anytime soon. The reasons are in the numbers.\" \n\nThe Fed is charged with three tasks: target and maintain a reasonable level of inflation, maintain price stability, and support full employment — in a word, as best as is possible, use monetary policy to stimulate and support reasonable levels of growth in the economy without allowing it to become overheated or grow cold. \n\nFirst, inflation: Last year, the inflation rate was 1.6 percent, and the year before it was 1.5 percent. The latest inflation rate for the United States is 0.2 percent through the 12 months ending July 2015. The Fed's target is 2 percent, so from the numbers it is pretty clear that inflation isn't going in the right direction for the interest rate hawks. Why would you raise rates when it slows growth, inhibits demand and depresses prices? Their argument is that inflation is being suppressed by depressed commodities prices that are volatile and are likely to rise. Therefore, the Fed should start the move toward a soft landing. This is an interesting argument, but unfortunately has little merit when you consider that slowing growth around the globe, especially in China, seems to be chronic, and commodities prices across the board are likely to remain depressed. \n\nSecond, price stability: If inflation is low, it means quite simply that prices have not risen. In this regard, the fly in the ointment is pricing that is tied to the relative strength of the dollar; specifically, imports. The U.S. is an $18 trillion economy. Imports account for 15.2 percent, or $2.75 trillion, of our economic activity. If the dollar increases in value relative to other currencies, 15 percent of our goods and services get more expensive. Conversely, as the dollar strengthens, our exports become more expensive and less likely to be competitive in a world economy. In 2013, the U.S. exports totaled $2.3 trillion, which means that 13 percent of the economic activity was tied to the strength of the dollar. The dollar has risen 14 percent in value since the beginning of 2015, and that is without a rate hike from the Fed. The rise is largely due to the strength of the economy relative to weaknesses elsewhere. What happens to the dollar when the Fed raises interest rates? The value of the dollar increases. So the proposition before the Fed is that if you want to put the brakes on the economy, raise rates. The economy grew at the rate of 2.3 percent last year. The Fed would like to see a 3 percent growth rate. Raising rates doesn't get you there. \n\nInterest rate hawks argue that raising rates from their very low level will not adversely affect commerce because the rise will be so small it will have no impact. The rate hike would have symbolic importance, they feel, because it would send a signal that the Fed is consciously moving to prevent future excesses. An example would be the recent rise in the housing market and the potential for a bubble because consumers are enjoying historically low borrowing rates. Conversely, however, the rate hike has a disproportionate impact on the import/export equation, as the dollar simply becomes more attractive than it already is. Interest rate hawks have to deal with the problem that their strategy isn't a very good bet for getting inflation to the 2 percent target or sustaining the economic growth rate. \n\nFinally, full employment: We are told the unemployment rate is 5.2 percent and there are arguments and discussions as to what constitutes full employment. The topic has become increasingly germane, since many question the accuracy of that number. The focus is on how many people are out of the workforce because they gave up looking for jobs; they are underemployed because they're working part-time, but would prefer full time work; or more recently, they are retired or semi-retired baby boomers who might come back into the worker force if wages move up. \n\nWe take a very simplistic view of the discussion; namely, if the nation were fully employed, there would be upward pressure on wages and income. Average wage increases for the past 12 months ending this past June were 2.1 percent, which, given the inflation numbers, is a meaningful increase. But the increases follow the previous year (2013) when the increase of 1.28 percent didn't even cover rising inflation. Most economists would agree that wages have not recovered from decreases incurred during the 2008-2009 recession. \n\nSo, the Fed is dealing with the following: inflation that is tending toward deflation, a reasonable growth rate that is at risk in the presence of a rising dollar and employment figures that are tending toward full employment but without increasing wages. \n\nThe Fed should not raise interest rates in this environment, especially when the global economy is looking increasingly unstable and the U.S. is increasingly looking like an oasis in what could quickly become a desert. Since the commissioners are smart folks, the odds are they will not any time soon. \n\nRussell is managing director of Cove Hill Advisory Services.", "source": "The Hill"}