{"published": "2015-09-28T15:10:00Z", "media-type": "News", "title": "United States Consumer Perspectives for the Food and Beverage Packaging Innovation Market", "id": "49d1549e-385e-4a02-a3e7-245f41c9177b", "content": "DUBLIN , Sept. 28, 2015 /PRNewswire/ -- \n \nResearch and Markets ( http://www.researchandmarkets.com/research/7d6stb/food_and_beverage ) has announced the addition of the \"Food and Beverage Packaging Innovation in the U.S.: Consumer Perspectives\" report to their offering. \n \nFrom purchase off the shelf through consumption, packaging for food and beverages is evolving to intersect with consumer needs and desires, and for good reason. Categories and brands benefit significantly and are at times completely rejuvenated when manufacturers and retailers merge consumer trends with packaging innovations, from the playfully pop-culture oriented to the futuristic and highly technical. \n\nDramatic changes in demographics, lifestyles, and eating patterns are creating new opportunities for food and beverage packaging. Among the demographic mega-trends feeding into package development are changing population distribution, fewer married couples and more people living alone, smaller household size, and multi-generational households. These demographic changes are leading to changes in household dynamics and eating behaviors, such as multi-shopper households, more meals being eaten alone, and more snacking on more occasions. Also changing is the balance between perishable foods and beverages merchandised in stores' so-called perimeter departments and the shelf-stable and frozen foods merchandised in the center-store aisles. \n\nTo further take advantage of the dynamic environment, marketers and retailers must understand what matters most to consumers, and what packaging innovations can deliver benefits that actually impact behavior. \n\nKey Topics Covered:  \n\nChapter 1: Executive Summary \n \nChapter 2: Overview \n\n \nChapter 3: The Consumer \n\nChapter 4: Packaging Trends \n\nFor more information visit http://www.researchandmarkets.com/research/7d6stb/food_and_beverage  \n \nMedia Contact: Laura Wood , +353-1-481-1716, press@researchandmarkets.net \n \nSOURCE  Research and Markets \n \nRELATED LINKS \nhttp://www.researchandmarkets.com", "source": "PR Newswire"}