{"published": "2015-09-16T10:14:37Z", "media-type": "News", "title": "RegScan Releases New Applicability Wizard", "id": "b091fde2-472f-48f6-bc87-6d55253c4a80", "content": "[September 16, 2015] \r \r \r\n\r\n    \r\n\r \r \nWILLIAMSPORT, Pa. , Sept. 16, 2015 /PRNewswire/ -- RegScan, Inc., a Williamsport, Pa. -based compliance management company, is proud to announce the development of its latest innovation, the Applicability Wizard.  \n\r\n\r \nApplicability Wizard is so intuitive that it will automatically map to the requirements that you need to comply with, based on your answers to a series of screening questions. No need to answer 50,000 questions when just 50 will do. Seamless integration with the easy-to-use Applicability feature on the RegScan One platform makes this advanced feature a must-have for anyone managing compliance at multiple global facilities. \n\r\n\r \n\"Environmental regulatory requirements and recognized operational standards continue to become more and more complex, so we felt there was a need to even further simplify the process,\" said Ned Ertel , President and C.E.O. of RegScan. \"By grouping large sets of requirements together, the Applicability Wzard can drastically reduce the amount of time and resources it takes to create legal registers and audit protocols tailored to your global facilities.\" \n\r\n\r\n\r\n\r \nUsers of the  RegScan One  system can create custom legal registers and audit protocols for more than 140 jurisdictions around the globe. Through the Applicability feature, they can easily filter out the requirements that don't apply to them. Additionally, users of the advanced Applicability Wizard feature have the luxury of working from a uniform set of screening questions that are applicable to almost any jurisdiction around the globe. \n\r\n\r \nAll legal registers and audit protocols created through the RegScan One platform can be exported to My WatchList, where they will be automatically monitored for changes. Completed Applicability Wizard projects can also be exported via web services to any online environmental management system. \n\nAbout RegScan: \nWith a dedicated staff of experts in three U.S. states and Washington D.C. , and an ever-growing network of in-country resources, RegScan can always be counted on as a trusted resource for up-to-date regulatory information from every corner of the globe. RegScan's unique online tools enable easy access to, and interpretations of, global environmental regulations and operational standards. Do your research and get your alerts through the  RegScan One  system, or have your content exported via web services to any online environmental management system. \n\r\n\r \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/regscan-releases-new-applicability-wizard-300143594.html \n\r\n\r \nSOURCE RegScan, Inc. \n\r\n\r \n[ Back To TMCnet.com's Homepage ]", "source": "Green Technology"}