{"published": "2015-09-08T16:00:41Z", "media-type": "Blog", "title": "Detroit Red Wings: Who Could Dan Cleary Possibly Displace?", "id": "1226cbee-c3d8-4c27-a6e9-1efe4ec25e1f", "content": "Next1 of 4Prev post\nUse your ← → (arrows) to browse\nDec 15, 2013; Detroit, MI, USA; Detroit Red Wings center Joakim Andersson (18) during the game against the Tampa Bay Lightning at Joe Louis Arena. Mandatory Credit: Rick Osentoski-USA TODAY Sports Much to the displeasure of basically every fan of the Detroit Red Wings, General Manager Ken Holland and company made good on their gentleman’s-agreement with Dan Cleary and recently re-signed the 36 year-old forward to a one-year contract with the team. Now Cleary will have the opportunity to battle for a roster spot at the Red Wings’ training camp in Traverse City later this month. The reality of the situation is that Dan Cleary will most likely not win a roster spot but instead will be sent to play in Grand Rapids and/or spend a lot of time as a healthy scratch. But for the sake of argument let’s examine some players that Cleary could potentially beat out to land a starting spot on the Red Wings’ roster. Joakim AnderssonMuch like Dan Cleary, Joakim Andersson will find himself battling for a roster spot in Traverse City at the Red Wings’ Training camp. Andersson has been a reliable bottom-six call-up for Detroit over the last few seasons, but also may struggle in finding a spot on this year’s team. Last season Andy played in 68 regular-season games with the Red Wings, scoring 3 goals and 5 assists. He also played in all seven of Detroit’s post-season games against the Tampa Bay Lightning during their opening round series of the Stanley Cup Playoffs. In those seven playoff games Andersson scored 1 goal and 1 assist. Andersson may not be a big points player, but he’s a solid penalty killer/grinder who has played his role well whenever being called up from Grand Rapids. In the last three seasons Andersson has appeared in 171 regular-season games with the Red Wings, producing 14 goals and 19 assists. A healthy Dan Cleary could fit into the role that Andersson normally fills when being called up to Detroit, and his veteran knowledge/presence could give him a slight edge over the younger Andersson. Both players will still be long shots to make the team in my opinion. Next: Landon Ferraro Next1 of 4Prev post\nUse your ← → (arrows) to browse", "source": "Octopus Thrower"}