{"published": "2015-09-06T10:14:00Z", "media-type": "News", "title": "Nelson Bay Golf Club vows to rebuild", "id": "fde22945-db28-4223-a1b0-395a0d1a4960", "content": "IT had been the beating heart of Nelson Bay for more than 50 years, a place some gathered for a hit and others flocked to for after-dark shenanigans. IT had been the beating heart of Nelson Bay for more than 50 years, a place some gathered for a hit and others flocked to for after-dark shenanigans. And even as the smoke continued to billow out of Nelson Bay Golf Club on Sunday, its current custodians vowed to return bigger and better.\n\n‘‘This is more than a golf club, it is a huge part of the community,’’ president Max Pride said.\n\n‘‘It is the hub of a lot of people’s lives. It is devastating but we will get through it.’’\n\nAn early morning fire, believed to have started in the roof cavity, quickly spread to destroy the majority of the club. A huge verandah and the club’s pro-shop underneath may remain standing, but most of the building will need to be levelled and rebuilt.\n\nThe club’s 35 employees, as well as possibly a couple of dozen who work in the restaurant Blue Water Grill, are now without work.\n\nRestaurant proprietor Will Semmens said the place was booked out for Father’s Day lunches and dinners.\n\nWedding receptions, sporting club presentation nights and other functions have also been affected.\n\nThe golf course was not damaged, and Mr Pride said it may reopen within days once a portable clubhouse is organised.\n\n‘‘There is no impact on the golf course itself except for the fact that we can’t process green fees and the like,’’ he said.\n\nThe club was originally built in 1963, with multiple additions as the Tomaree peninsula grew and took the club with it.\n\nIt has about 3500 current members, including about 1500 playing members.\n\nSocial media was inundated with messages of sympathy.\n\nFire crews were first called about 12.30am but it was too late to save the club.\n\nFirefighters were forced to withdraw from inside the club as the flames shot through the roof cavity, collapsing large sections onto what was once the club’s bar, auditorium, office and poker machine areas.\n\nCrews remained at the scene for most of Sunday to help extinguish spot fires which flared up.\n\nSome golfers who turned up for a spring round had been unaware of the fire and were turned away.\n\nFire investigators were looking into the source of the blaze, although early indications were that it began in the roof and quickly spread. The story first appeared on Newcastle Herald.", "source": "Glen Innes Examiner"}