{"published": "2015-09-22T01:11:43Z", "media-type": "News", "title": "Is Jameis Winston a 'game manager' and is that a bad thing?", "id": "28a7eb48-3637-4364-801a-a79b0f82918e", "content": "Is it bad if Jameis Winston refers to himself as a 'game manager' after his first victory as an NFL starter? Not to Bucs coach Lovie… \r \nBut after Sunday's Bucs 26-19 win against the Saints, Winston used two words to define his role that rarely has been associated with the Heisman Trophy winner. \n\n\"I just want to go out there and do my job and be a game manager right now,\" Winston said. \"Who knows what my future holds right now? But I just want to be a game manager, put our team in the best possible situation I can for us to win and I feel like we as a team did that.\" \n\nUsed to be the worst thing you could call an NFL quarterback was a game manager. Or Trent Dilfer. \n\nAnd correct me if I'm wrong, but you don't draft someone like Winston No. 1 overall to \"manage the game.\" It's like handing Michelangelo a roller brush. Or Joey Chestnut fasting. \n\nBut that's what Winston did until 1:15 left late in the first half Sunday, after the Saints had taken a 7-3 lead. Up to that point, Winston was 4 of 7 passing for 44 yards. That was when the training wheels went in the garbage. \n\nOn a remarkable six-play, 63-yard drive, Winston showed off his arm. He went 4 of 5 for 54 yards and started a debate over which pass was prettier. Was it the laser he fired into the middle of four defenders to Vincent Jackson for a 17-yard gain on third and 16? Or was it the dime he dropped into Jackson's hands in the back of the end zone? \n\n\"You know, third and 16 was good,\" Bucs coach Lovie Smith said. \"But the touchdown pass, there was just a small window and he had to release it at a certain time. Good coverage on their part. That was a great throw. It might have been Jameis' best throw on record here, I'd say.\" \n\nAfter a 22-yard bullet to Jackson on a deep cross to start the second half, Winston heaved the ball 41 yards to the end zone, where receiver Louis Murphy was interfered with. The play set up Winston's nifty 1-yard touchdown run on a bootleg to his left. \n\n\"Jameis' speed is talked about an awful lot,\" Smith said. \"What a quarterback needs to do when he needs to run and be mobile in the pocket, he did that. I thought that was a pretty impressive touchdown run he had, too.\" \n\nWinston was 14-of-21 passing for 207 yards with a TD and no interceptions for a rating of 114.6. The last time he threw fewer passes was in his Florida State debut in 2013 against Bethune-Cookman, when he had 19 before being pulled in the second half. \n\nSo why is Winston a game manager? Couldn't he be a bigger part of the offense? \n\nFor starters, the Bucs don't want to put too much on Winston's plate as a rookie. Even Smith couldn't be sure Winston would bounce back from his disastrous NFL…", "source": "MyInforms"}