{"published": "2015-09-29T13:00:00Z", "media-type": "News", "title": "Snowflake Computing to Sponsor and Exhibit at AWS re:Invent 2015", "id": "f2e40d1e-ab10-423a-9395-0dd053d431f4", "content": "SAN MATEO, CA -- (Marketwired) -- 09/29/15 -- Snowflake Computing , the cloud data warehousing company, today announced it will sponsor and exhibit at the sold-out AWS re:Invent 2015, the largest gathering of developers, users and technical leaders from the Amazon Web Services community. The conference will be held Oct. 5-9 at The Venetian in Las Vegas. \n\nLocated at booth #524, Snowflake Computing will be providing live demonstrations of the Snowflake Elastic Data Warehouse , the first data warehouse designed for the cloud from the start. Visitors will learn first-hand from experts about Snowflake's patent-pending architecture and cloud data warehousing. Attendees will also have the opportunity to receive a free branded T-shirt by taking the Snowflake Challenge -- a quick, anonymous survey to find out if their current data warehouse environment is up for today's ever-changing data challenges. \n     \nIn June, the company announced the general availability of its Elastic Data Warehouse, bringing enterprise-class data warehousing and new innovations to any scale of data, workload and users. The release delivered key innovations -- some of which includes native support and optimization for diverse data, automated management and optimization and enterprise-class security. Also announced in June was their $45 million in Series C funding , led by global investment firm Altimeter Capital and joined by existing investors Redpoint Ventures, Sutter Hill Ventures and Wing Ventures. \n\nSee what customers are talking about \nVisitors to the Snowflake booth #524 will see the cloud data warehouse that customers, such as KIXEYE, Accordant Media, VoiceBase and White Ops are using to get fast access to insights from their business data. \n\nConnect with Snowflake \nTo schedule one-on-one meetings with Snowflake executives or to schedule a demo, contact media@snowflake.net . \n\nTweet This \n. @SnowflakeDB to sponsor and exhibit at AWS #reInvent. Visit booth #524 for live demos & more \n\nSnowflake Resources \n\nAbout Snowflake \nSnowflake Computing, the cloud data warehousing company, has reinvented the data warehouse for the cloud and today's data. The Snowflake Elastic Data Warehouse is built from the cloud up with a patent-pending new architecture that delivers the power of data warehousing, the flexibility of big data platforms and the elasticity of the cloud -- at a fraction of the cost of traditional solutions. The company is backed by leading investors including Altimeter Capital, Redpoint Ventures, Sutter Hill Ventures and Wing Ventures. Snowflake is headquartered in Silicon Valley and can be found online at snowflake.net .", "source": "Marketplace"}