{"published": "2015-09-18T21:11:22Z", "media-type": "Blog", "title": "Coca-Cola: IRS says we owe $3.3B in back taxes", "id": "2b76512b-66d3-4ac3-9445-30ca5416ea89", "content": "NEW YORK - Coca-Cola (KO) was notified by the IRS that it owes $3.3 billion more in federal taxes, as well as interest, for 2007 to 2009, the company said Friday.\nThe Atlanta-based company said in a regulatory filing that it believes the assessments from the Internal Revenue Service are without merit and plans to pursue \"all administrative and judicial remedies necessary to resolve the matter.\"\nThe maker of Sprite, Dasani, Powerade and other drinks says the disagreement is over how much it should report as taxable income in the U.S., in relation with licensing that allows its foreign affiliates to sell products overseas.\nIt's a tax issue that comes up frequently for multinational companies, said Robert Willens, president of tax accounting consultancy in New York. He said companies tend to charge their foreign subsidiaries low licensing fees as a way to shift reportable income from the U.S., where corporate taxes are higher.\nTypically, Willens said, the cases are settled for a fraction of the amount of the assessment.\n\"They hardly ever get to court, because neither party wants to experience the hazards of litigation,\" Willens said.\nIn a filing with the Securities and Exchange Commission, Coca-Cola said it has been following the same methodology for determining its taxable U.S. income for nearly 30 years.\n\"The IRS now seeks to depart from this long-standing practice in order to increase substantially the amount of tax,\" the company said in a statement. \"We are among hundreds of other companies currently facing these types of adjustments involving payments.\"\nCoca-Cola Co. said it was notified that a recommendation has been made to the IRS's chief counsel that the matter be designated for litigation. The company said it plans to start disputing the matter by filing a petition in U.S. Tax Court.\nIt said the IRS made the determination on owed taxes after a five-year audit.", "source": "MoneyWatch - CBSNews.com"}