{"published": "2015-09-24T13:21:35Z", "media-type": "News", "title": "Outcry After Puppy Taken From Homeless Man", "id": "9e7cbab0-fcdc-40e0-aa33-0eb372496c27", "content": "A French animal rights group is under fire for taking a puppy from a homeless man in central Paris.\n\nFootage of three activists ripping the dog away from the man appeared online, prompting a strong backlash.\n\nThe video shows the campaigners push away the wailing man as he tries to stop them taking his dog, which yelps throughout the ordeal. \n\nA crowd watches on as a woman shouts at the activists: \"You don't have the right to do this!\"\n\nNghi Le Duc, who filmed the footage at the weekend, said the Cause Animale Nord activists \"violently\", \"mercilessly\" and \"without pity\" took a \"homeless man's friend\".\n\n\"I was shocked when I saw this scene in the streets of Paris,\" he said in a caption accompanying the video which has been viewed more than 100,000 times.\n\nBut Cause Animale Nord defended taking the animal, claiming \"the Roma\" man had drugged the puppy so it would stay calm.\n\nThe dog had dilated pupils and its cries heard on the video \"are not normal\", said Antony Blanchard, the group's chairman, in a statement.\n\nMr Blanchard also said the dog was not chipped and not vaccinated - against French law.\n\nHe added \"we know how important the presence of an animal is for people living on the street\" but the group \"cannot condone the exploitation and abuse of animals for commercial ends\".\n\n\"If the state services did their work we would not have to,\" Mr Blachard added.\n\nCause Animale Nord has since posted images on Facebook of the puppy, which they renamed Vegan as a tribute to \"our beliefs\".\n\nThey have put it up for adoption for a fee of €195 (£144) and describe it as \"full of joy and playful\".\n\nNearly 60,000 people have signed a Change.org petition calling for an investigation into Cause Animale Nord.\n\nThe petition says in taking the dog \"they went too far\" and calls for the group to provide evidence the dog was drugged.\n\n\"Nowhere (in the group's rules) is it stated that they have the right to remove without notice any animal or that is what they did by attacking a homeless violently to take his pet (a puppy),\" the petition states.\n\nThe group has also been strongly criticised on its", "source": "Sun fm103.4"}