{"published": "2015-09-06T19:23:00Z", "media-type": "News", "title": "Badger Rewind: Opener offers opportunities for UW's youth", "id": "f6772d01-6143-43e6-8f2b-87ba17b892d2", "content": "[embedded content] \n   \nSept. 6, 2015 \n\nBY MIKE LUCAS \nUWBadgers.com \n\nARLINGTON, Texas -- As a former high school quarterback, T.J. Edwards was accustomed to probing a defense in an attempt to uncover areas that potentially could be exploited because of inexperienced personnel. Attacking a freshman is the same at any level. Edwards got a taste of that reality from the other side of the equation here Saturday night in his first start as a Wisconsin linebacker. \n\n“It was a learning experience -- first and foremost,” said Edwards, a redshirt freshman from Lake Villa, Illinois. “I grew up and over the next couple of days, I will grow up even more just from learning from this. It’s tough right now, so I feel a little disappointed.” \n\nAn emotionally bankrupt Edwards was speaking moments after Alabama’s methodical 35-17 victory over the outmanned Badgers in the AdvoCare Classic at AT&T Stadium. The 6-foot-1, 238-pound Edwards finished with 12 tackles (6 solo), including one TFL; second most on the UW defense behind senior outside linebacker Joe Schobert who had 13 tackles, four TFLs and two quarterback sacks. \n\nUW defensive coordinator Dave Aranda expected that Edwards would encounter some growing pains in his college debut. But he didn’t anticipate losing his leading tackler, safety Michael Caputo , to a head injury on the first series of the game. Caputo was injured tackling Tide tailback Derrick Henry, a 246-pound brute with quick feet and an explosive burst. He scored on runs of 37 and 56 yards. \n\nCaputo’s replacement was sophomore D’Cota Dixon, a converted linebacker. Dixon appeared in only three games as a freshman in 2014 before being sidelined the rest of the year with an injury. Although he had flourished as a defensive back at New Smyrna Beach (Florida) High School, he was entering a brave new world against a heavyweight like Alabama, not that he had much time to think about it. \n\n“I just heard people calling my name (on the UW sideline),” said Dixon, whose older brother is a former safety at Florida and a Ball State assistant. “I had no idea of what happened until I saw him (Caputo) on the offensive side of the ball (Caputo almost wandered into the Alabama huddle) and then I knew something was seriously wrong. So I just put on my helmet and I had to put on the big-boy pants.” \n\nOnce on the field, he admitted, “There was anxiety. I was nervous. It was fast, real fast at first.” \n\nDixon had been groomed throughout preseason training camp as a backup. And, now, all of a sudden, he was taking over for an accomplished fifth-year senior in Caputo -- the captain, the catalyst and the most established communicator and signal-caller; the quarterback on defense. Without prodding, Caputo has been a willing teacher and mentor to the younger players like Dixon. \n\n“He (Caputo) was helping me throughout the whole game,” said a grateful Dixon. “He was telling me certain routes (that Bama favored) and what to expect making the adjustments. He helped a lot. I see why Caputo plays the way he does (fast), and it just comes with experience. As the game went on, I got comfortable. I learned a lot.” \n    “We’ve got a long ways to go — obviously we struggled in some areas,\" Erickson said. “I liked the way we fought and finished the game. That’s what this group is all about.\"  \nCaputo was not only helping Dixon get acclimated to the game speed and the Tide attack, which was triggered by a first-time starter in Jake Coker, who had been Jameis Winston’s understudy at Florida State, but he was also encouraging Edwards. “From the sidelines, he was giving us calls, just being the leader that he is,” Edwards said. “But it’s the next man up and he knows that more than anyone.” \n\nAlabama offensive coordinator Lane Kiffin didn’t have any problem identifying that the Wisconsin defense was vulnerable in the middle because of the inexperience of the safeties (Dixon and Leo Musso ) and the inside linebackers (Edwards, Leon Jacobs and Chris Orr , a true freshman). Some of the bigger passing plays were in that part of the field, over the linebackers and in front of the safeties.  \n\n“I didn’t feel like I did very well for my first game,” confided Dixon, who nonetheless was UW’s third-leading tackler with eight. “I really wasn’t expecting to play the whole game like I did. I got hit a couple of times and I was more alert and had more football awareness; it cleared my head. I never played in a game this crazy; there was a lot to learn and it was a wake-up call.” \n\nEdwards felt the same way. “There are definitely some things we have to work on -- me and as a team,” said Edwards, who missed valuable practice time early in camp because of an injury; as did Jacobs, who was reinjured Saturday. “Playing with effort was a positive,” Edwards said. “I tried to do that and the defense did as a whole. I’m encouraged how we can move forward from this and keep building.” \n\nOFFENSE ADJUSTS \nThe Badgers weren’t at full strength on offense, either. Tailback Corey Clement was limited to just eight carries as the result of an injury that he sustained during practice last week. How much of a difference would a healthy Clement made in the running game? That’s hard to say because the Alabama defense, especially the front seven, is so dynamic, so deep, so dominating. \n\n“I know there are some things as an offensive line, as a unit, that we need to fix -- we didn’t have much of a running game,” said left tackle Tyler Marz . “Our communication needs to be better. I think we did some pretty good things, so we can build on that. But we have to fix what we can fix.” \n\nUnlike a year ago at this time, quarterback Joel Stave doesn’t need any fixing. In the first half, he completed 14 of 16 passes for 149 yards and one touchdown; the 39th of his career, moving him past Randy Wright and Brooks Bollinger for the third-most in school history. Stave had an undeniable presence in the pocket despite the pressure. The lack of a running threat conspired against him in the second half, along with a more urgent Tide defense. \n\n“I’m confident with Joel all the time,” said Marz, a fifth-year senior and one of two returning starters on the O-line. “He had a great camp and he did some good things tonight when the pass protection was solid. He was throwing bullets and we need him to keep doing that … (but) it definitely hurts a little bit when he (Clement) is not in there. He’s a good player and we need to get him healthy.” \n\nThe Badgers unveiled a new short passing game designed by head coach Paul Chryst and offensive coordinator Joe Rudolph to take advantage of the receiving skills of the running backs: Dare Ogunbowale had six catches, Derek Watt had five, Clement had two and Taiwan Deal had one. That adds up to 14 of Stave’s 26 completions. Erickson led both teams with 73 receiving yards on six receptions. \n\n“We’ve got a long ways to go -- obviously we struggled in some areas (of the offense),” said Erickson, a fifth-year senior from Darlington and Wisconsin’s leading returning receiver. He had 55 catches last season. “I liked the way we fought and finished the game; the way we kept battling. That’s what this group is all about. We can build on things and improve on things that needed to be improved.” \n\nAt halftime, the Badgers trailed 14-7. And it could have been 14-10 had Rafael Gaglianone’s field goal attempt from 34 yards not doinked off the upright. The first half stats were pretty even. Wisconsin had 29 plays and 171 yards of total offense; Alabama had 30 plays and 199 yards. Moreover, the UW offense got the ball to start the third quarter. But they had three empty possessions: 11 plays, 12 yards. \n\n“We were right where we wanted to be at half,” said Erickson, who had the Badgers’ longest run from scrimmage, a 22-yard scamper on a jet sweep. “We had the ball and a chance to tie up the game and we knew that we wanted to stay close to them just to give ourselves a chance at the end of the game. But it didn’t go that way and we just have to learn from it.” \n\nAsked about not having Caputo’s leadership and playmaking on defense and a less than effective Clement on offense, Erickson said, “They’re two of our best players. But we’re not using it as an excuse. Obviously the game didn’t go the way we wanted, but we saw some things we can improve on that will make us a better team.”", "source": "UWBadgers.com"}