{"published": "2015-09-30T11:53:38Z", "media-type": "News", "title": "Woolly sheep finds his way into the Guinness Book of World Records", "id": "e79a877e-fd38-4b36-8364-ce67fb366a6e", "content": "The Guinness Book of World Records has confirmed that the fleece taken from an Australian merino sheep is the most wool sheared in a single sitting. \n\nChris the sheep was found wandering outside Australia’s capital Canberra in early September and it was clear that he was in desperate need of a haircut. \n \nPic via RSPCA \n \nRSPCA ACT put out an emergency call for an experienced shearer as sheep can become seriously ill if left unshorn. \n \nChampion shearer Ian Elkins volunteered his services and, earlier this month, with four helpers, set to unloading Chris of his monumental fleece. \n \nThey then weighed it and it came in at an astounding 41.1 kilograms (6.4 stone). Elkin believes it was the result of seven years of unmanaged growth and was double the sheep’s body weight. \n \n#Canberra 's very woolly sheep sets world record for the heaviest fleece according to @rspcaact  http://t.co/vGeOfo7PJ3  pic.twitter.com/nHOw7Lxr4f \n— ABC News Canberra (@abcnewsCanberra) September 3, 2015  \nThe previous recordholder was Big Ben from New Zealand whose fleece came in at 29kg. \n \n\"We certainly didn’t have the world record as a priority when we sheared Chris,\" RSPCA ACT chief executive Tammy Ven Dange said. \n \n\"But we appreciate the recognition. We can only hope that record is never broken again because it would be unlikely that the animal would live to tell the story.\" \n \nChris’ fleece was donated to a museum and he now lives happily at a hobby farm in New South Wales. \n \nAnd this is what he looks like now. \n \nFor those needing your Chris video fix! He's feeling much better. #CHRIStheSHEEP  #Chris  @rspcaact  #Canberra  #CBR  pic.twitter.com/56ZAJAAJOm \n— Tammy Ven Dange (@tvendange) September 9, 2015  \nBit of a change, alright. \n \nHT: breakingnews.ie \n\n© Irish Examiner Ltd. All rights reserved", "source": "Irish Examiner"}