{"published": "2015-09-29T22:32:13Z", "media-type": "News", "title": "Chattanooga, Tenn. Chosen to Host the 2017 IRONMAN 70.3 World Championships", "id": "37e620bb-59ae-43ff-b838-87e4df1e525a", "content": "The Chattanooga Convention and Visitors Bureau announced today that IRONMAN has chosen Chattanooga, Tenn. to host the 2017 IRONMAN(R) 70.3(R) World Championships. The championships will take place over two days: professional and age-group women will race on Saturday, Sept. 9, 2017, and the professional and age-group men will race on Sunday, Sept. 10, 2017. \n\n\"We are incredibly excited that our community was chosen to host the 2017 IRONMAN 70.3 Championships. Chattanooga is now the IRONMAN Capital of the Planet,\" said Bob Doak, president and chief executive officer for the Chattanooga Convention and Visitors Bureau. \"This two-day event will leave an estimated economic impact of $20 million in our community. That's impressive. We would not have been able to do this without the existing strong partnership with IRONMAN and the dedication and support of the entire community.\" \n\nWhy hosting this championship is significant for Chattanooga: \n\n1. Chattanooga is 1 of 5 cities in North America to host both a full-distance IRONMAN and a 70.3 IRONMAN \n\n2. Chattanooga is 1 of 10 cities in the world to host both a full-distance IRONMAN and a 70.3 IRONMAN \n\n3. Chattanooga is the ONLY city on the planet to host a full-distance IRONMAN, a 70.3 IRONMAN and the 70.3 IRONMAN World Championships (two events, two days) \n\nChattanooga beat out two other venues where IRONMAN races are held in Lake Placid, New York and St. George, Utah. \n\nDoak added, \"We have now joined the ranks of world cities to host this international event. In 2014 it was held in Mont-Tremblant, Quebec, Canada; this year, it was held in Zell am See, Austria; in 2016, Mooloolaba, Queensland, Australia; and then in 2017, Chattanooga, Tenn. The first time the United States will be eligible to host this event again will be in 2025. This is truly a once-in-a-lifetime opportunity.\" \n\nThe IRONMAN 70.3 World Championship is the pinnacle event in the global IRONMAN 70.3 calendar. Throughout the 2017 season, IRONMAN expects more than 185,000 registered athletes will race at over 100 IRONMAN 70.3 races around the world. From those races, more than 4,000 athletes will qualify to race in the IRONMAN 70.3 World Championship. \n\n\"Since 2006, the IRONMAN 70.3 race series has grown exponentially around the world and has seen global success with the annual change in host region of the IRONMAN 70.3 World Championship. As we continue to rotate the pinnacle event for the series, it is with great pleasure to announce that Chattanooga, Tennessee has been selected as the host city for 2017,\" said Andrew Messick, chief executive officer for IRONMAN. \"Chattanooga is a first-class city, fully qualified and well-equipped to deliver a world-renowned event, and we look forward to providing our athletes with an unforgettable championship race experience.\" ABOUT THE CHATTANOOGA CONVENTION & VISITORS BUREAU \n\nThe Chattanooga Convention & Visitors Bureau is a non-profit, Hamilton County funded organization, formed to strengthen the area economy through the marketing and promotion of the Chattanooga area as a year-round destination for meetings, conventions, sporting events and leisure travel. http://www.chattanoogafun.com \n\nABOUT IRONMAN \n\nThe iconic IRONMAN(R) Series of events is the largest participation sports platform in the world. Since the inception of the IRONMAN(R) brand in 1978, athletes have proven that ANYTHING IS POSSIBLE(R) by crossing finish lines at the world's most challenging endurance races. Recognized for excellence through distinguished events, world-class athletes and quality products, IRONMAN has grown from a single race to a global sensation with more than 190 events across five unique brands: IRONMAN(R), IRONMAN 70.3(R), 5150™ Triathlon Series, Iron Girl(R) and IRONKIDS(R). http://www.ironman.com", "source": "Wall Street Select"}