{"published": "2015-09-10T14:57:55Z", "media-type": "News", "title": "Imagination to Address Collaborative Development of Advanced IP Subsystems at the TSMC 2015 Open Innovation Platform Ecosystem Forum", "id": "b8a33d49-710f-40c5-b37e-0a18488485be", "content": "Company News: Page (1) of 1 - 09/10/15     print\n\t    \tpage         (September 10, 2015) \nLONDON, Sept. 10, 2015 (GLOBE NEWSWIRE) -- Imagination Technologies (IMG.L) announces that its experts will present details of advanced collaborations with TSMC at the company's Open Innovation Platform® (OIP) Ecosystem Forum to be held on September 17 th in Santa Clara, CA. The day-long event will bring together the semiconductor design chain community and over a thousand director-level and above TSMC customer executives. The OIP Forum will feature a three-track technical conference along with an Ecosystem Pavilion. \n\n\n\nWho: \n\nImagination, a global leader in multimedia, processor, communication and cloud technologies \n\n\n\n  \n\n  \n\n\n\nWhat: \n\nImagination presentations at the TSMC OIP include: \n\n\n\n  \n\n  \n\n\n\n  \n\n* \" Design of an integrated wireless 4K video camera SoC IP platform \": Alan Aronoff, Imagination's director of strategic business for IMGworks, will talk about the collaboration between Imagination and TSMC focused on delivering a reference design targeted for 4K video imaging and display to accelerate time to market and simplify the design process for mutual customers \n\n\n\n  \n\n* \"Optimizing Imagination Technologies PowerVR GPU using 16nm FinFET\": this paper by Colin McKellar, senior director of hardware engineering, focuses on the successful collaboration between Imagination and TSMC to optimize ecosystems and enhance the overall performance, power and area of Imagination's PowerVR Series6XT GPU on TSMC's 16nm FinFET process \n\n\n\n  \n\n  \n\n\n\n  \n\nExhibits: during the conference, Imagination will highlight demonstrations and applications of its technologies including MIPS CPUs, PowerVR GPUs, Ensigma RPUs for connectivity, and FlowCloud device-to-cloud technology, and will also showcase the latest chips and OEM products using these IP solutions. Attendees can check out these demonstrations in Imagination's booth (# 311) in the Ecosystem Pavilion. \n\n\n\n  \n\n  \n\n\n\nWhen: \n\nSeptember 17, 2015, 8:00 am – 6:00 pm \n\n\n\n  \n\n  \n\n\n\nWhere: \n\nSanta Clara Convention Center, CA \n\n\nMore details about Imagination's participation at the TSMC OIP are available at http://imgtec.com/event/tsmc-open-innovation-platform-ecosystem-forum-2015/ \n\n\nAbout Imagination Technologies \n\n\n\nImagination is a global technology leader whose products touch the lives of billions of people across the globe. The company's broad range of silicon IP (intellectual property) includes the key processing blocks needed to create the SoCs (Systems on Chips) that power all mobile, consumer and embedded electronics. Its unique software IP, infrastructure technologies and system solutions enable its customers to get to market quickly with complete and highly differentiated SoC platforms. Imagination's licensees include many of the world's leading semiconductor manufacturers, network operators and OEMs/ODMs who are creating some of the world's most iconic products. See: www.imgtec.com . \n\n \n\nFollow Imagination on Twitter , YouTube , LinkedIn , RSS , Facebook and Blog . \n\n\nImagination Technologies and the Imagination Technologies logo are trademarks of Imagination Technologies Limited and/or its affiliated group companies in the United Kingdom and/or other countries. All other logos, products, trademarks and registered trademarks are the property of their respective owners.  \n\nCONTACT: Imagination Technologies' Press Contacts: \nUK: David Harold  david.harold@imgtec.com  +44 (0)1923 260 511 \nUSA: Jen Bernier-Santarini  jen.bernier@imgtec.com  +1 408-530-5178 \n\n\n\n\n\n\n\n\nPage: 1  \n \nRelated Keywords: SOFTWARE, ELECTRONICSPro AV, Presentors, Display, Camera/Film, Prosumer/Consumer, Business, 4K, Prosumer Camcorder, Business Issues, Presentation, People, Video, Science, Business, england, Other, \n\nSource:2015 GlobeNewswire, Inc. .\n All Rights Reserved", "source": "DV Format"}