{"published": "2015-09-11T02:20:10Z", "media-type": "News", "title": "What’s next for the Iran nuclear deal New 7:18 pm", "id": "e8b2e6ac-ef9b-4f36-be97-507306a4a7c1", "content": "WASHINGTON — With Senate Democrats blocking passage of a resolution disapproving the Iran nuclear deal, attention shifts to the nations and international agencies that must put the accord into effect. Here’s what happens next: \n \nQ: What is the first thing that will happen? \n \nA: The agreement is to be formally adopted Oct. 19, 90 days after it was endorsed by the U.N. Security Council. Oct. 19 is also the day Iran and the six world powers that concluded the accord — the United States, Germany, Britain, France, Russia and China — are to start taking steps to comply, although most of the early burden falls on Iran. \n   \nQ: When does the agreement take effect? \n Most Read Stories Seahawks’ Russell Wilson buys $6.7 million waterfront mansion in Bellevue, report says Kam Chancellor has backed himself into a corner with Seahawks, and not even his thunderous hits can help Struggling Haggen files for bankruptcy protection, parts with Southwest co-CEO Kam Chancellor speaks to NFL Network, says he’s willing ‘to meet the Seahawks halfway’ Empty classes, no talks as Seattle schools stalemate continues \nA: That does not happen until “implementation day.” Nobody knows when that may be. U.S. experts say it will take six to nine months for Iran to carry out the initial nuclear steps required for the accord to take effect. Iran insists it can act more quickly, in weeks or months. \n \nQ: What does Iran need to do before the accord goes into effect? \n \nA: Iran must reduce its large stockpile of low-enriched uranium to no more than 660 pounds from roughly 12 tons today, a 98 percent reduction. To do so, it will almost certainly have to ship fuel out of the country. It must also disassemble and store more than 13,000 centrifuges — it is only allowed to have 5,060 spinning — and convert the underground Fordo nuclear-enrichment site to a research-and-development installation. Iran must also remove and disable the core of its heavy-water reactor at Arak so it cannot produce plutonium, another pathway to a bomb. It must also make arrangements for inspections and monitoring by the International Atomic Energy Agency (IAEA) and begin answering questions about suspected military-related work on nuclear weapons — although the answers may take years to resolve, if they ever get resolved. \n \nQ: What do the U.S. and its negotiating partners need to do? \n \nA: The U.S. will waive many of its nuclear-related sanctions blocking business with Iran, starting on implementation day. The European Union (EU) also will terminate many of its sanctions on that day. Also, Iran will be granted access to its frozen assets abroad, mostly money from oil sales. Although Iran has as much as $125 billion in frozen assets, the U.S. Treasury Department says it would have immediate access to less than $60 billion because much of the money has been obligated, including for projects in China. \n \nQ: What are the “secret agreements” that Congress says it has not seen? \n  \nA: The two agreements are between the IAEA and Iran — and while Republican leaders in Congress call them “secret side agreements,” all agreements between the agency and countries that undergo inspections, including the United States, are kept confidential. These two are important, however, because they go to the heart of the question of whether Iran will allow meaningful inspections and will account for its nuclear history. There are reports that under one agreement, Iran will provide samples from a suspected nuclear-related site, Parchin, rather than allow agency officials to collect them. The other agreement describes the details of how Iran will answer the IAEA’s questions about past activities, including whether it will permit the interview of key scientists.", "source": "Seattle Times"}