{"published": "2015-09-15T19:53:00Z", "media-type": "Blog", "title": "Community groups respond to recent violence", "id": "d70445fe-0fb3-4706-b813-7c414d9c57a1", "content": "So far in the month of September there have been at least ten shootings in the city of Pittsburgh. This comes after a summer where there were at least 80 shootings throughout the city from Memorial Day to Labor Day.\nToday members from several Pittsburgh community organizations gathered at Freedom Unlimited in the Hill District to respond to these incidents.\nclick to enlarge\rPhoto by Rebecca Nuttall\rMembers of different community groups gathered in the Hill District\r\"We are collectively once again calling upon all persons who have committed and those who are contemplating any act of violence to please think twice,\" said Tim Stevens, co-convener of the Coalition Against Violence. \"And then think again, about how their acts of violence affect the loved ones of those who are shot and/or killed and the profoundly negative affects upon themselves and their futures.\"\nAfter reading off a detailed list accounting the recent shootings throughout the city, those in attendance talked about how their groups are working to address violence and what more can be done.\n\"From 1994, when I lost my son, until now, I don't see any difference. In fact, it's gotten worse,\" said Adrienne Young who lost her son more than twenty years ago. \"But there's more of us than there are of them.\"\nAlso present were representatives from CeaseFirePA, the Black Political Empowerment Project, Center for Victims of Violent Crime and Men Against Destruction Defending Against Drugs and Social Disorder (MAD DADS).\n\"I will be attending my 188th funeral of a young black male that I've worked with from the year 2000,\" said Richard Carrington, founder of Voices Against Violence. \"When are we going to say enough is enough?\"\nThe Coalition Against Violence is currently updating materials on preventing violent crime. Current editions can be found here.", "source": "Pittsburgh City Paper"}