{"published": "2015-09-21T17:28:01Z", "media-type": "News", "title": "UPDATE: Falae’s Abductors Demand N100m", "id": "a9ae4a5a-8141-4b64-89b6-9490ae35bb05", "content": "The abductors of Chief Olu Falae have demanded for N100m as ransom before the septuagenarian could be freed from their captivity. \n \nThe former Secretary to the Government of the Federation SGF and chieftain of the Afenifere, Chief Samuel Oluyemisi Falae Monday received the shock of his life on his 77th birthday as gunmen numbering over 20 invaded his farm in Ilado village, Akure north area of Ondo state and kidnapped him?. \n \nHe was abducted at about 1pm and by 3.20pm, the abductors demanded for N100m as ransom before the septuagenarian could be freed from their captivity. \n \nOver 50 policemen have been deployed to the village and its environ to search for him just as the state governor Dr Olusegun Mimiko has summoned an emergency state Security Council meeting on the matter. \n \nBorn on September 21, 1938, the former Finance minister was kidnapped by over 20 Fulani herd men who invaded his farm, attack his over 200 workers. \n \nThe 77-year-old politician was secretary to the military government of Ibrahim Babangida from January 1986 to December 1990 and was briefly the Finance Minister in 1990. \n \nHe ran for Nigeria’s president in 1999 on the joint platform of the Alliance for Democracy (AD) and the All People’s Party (APP) against Olusegun Obasanjo of the Peoples Democratic Party (PDP). \n \n* Source: Vanguard \n  \r \n\r How to Get FLAT BELLY in Just 9Days! \r \n\r Superb Premature EJACULATION spray. You 'll last 40minutes+ \r \n\r How i Generated over 20million In 2014. Over N1.5million monthly Being Made Consistently In 2015 Doing Digital Marketing. CLICK HERE To Learn. \r \n\r How to Start a Profitable IMPORTATION business with as low as N10,000 only. \r \n\r 3 Things I did to cure premature ejaculation after my wife left me \r \n\r 7 Simple Yet Amazing Steps to make N200,000 monthly working  2 hours daily", "source": "Nigeria Daily Independent"}