{"published": "2015-09-13T10:02:31Z", "media-type": "News", "title": "SNP manifesto to set out timescale for second referendum", "id": "a6c34ef3-ddeb-419a-aaa6-07ba4096600c", "content": "The SNP will set out the timescale for a possible second referendum on independence in its manifesto for next year's Holyrood election, Nicola Sturgeon has said. \n\nScotland's First Minister confirmed the party's manifesto will include more details on the circumstances under which another vote might be \"appropriate\". \n\nThe revelation comes almost a year after Scots voted by a margin of 55% to 45% to reject independence. \n\nSince then the SNP has gone from strength to strength, notching up thousands of new members and winning a landslide 56 of Scotland's 59 seats in May's general election. \n\nMs Sturgeon has come under increased pressure to clarify her position on a second vote ahead of the party's conference in Aberdeen next month. \n\nShe told the Press Association: \"Our manifesto will set out what we consider are the circumstances and the timescale on which a second referendum might be appropriate, but we can only propose. \n\n\"It's then for people in Scotland, whether it is in this election or in future elections, to decide whether they want to vote for our manifesto and then if there is in the future another independence referendum, whether that's in five years or 10 years or whenever, it will be down to the people of Scotland to decide whether they want to vote for independence or not. \n\n\"So at every single stage this is something that is driven by and decided by the people of Scotland, not by politicians.\" \n\nA recent Ipsos Mori survey for STV suggested 53% of voters in Scotland would back independence if there was another referendum. \n\nThe same poll put support for the SNP in the constituency vote at next year's Scottish Parliament election at 55%, compared to Labour's 21%. \n\nMs Sturgeon said: \"It doesn't surprise me in the slightest that support for independence has risen in the past year. \n\n\"We've seen a Conservative Government renege on its promises on more powers, we've seen them continue to impose austerity on the most vulnerable, George Osborne arrogantly pressing ahead with investment to support the renewal of Trident even though the House of Commons hasn't decided to renew Trident, our membership of the European Union being jeopardised.\" \n\nThe First Minister has previously said a material change in circumstances, such as Scotland being taken out of the EU against its will in the forthcoming in-out referendum on UK membership, could act as a trigger for a second referendum on independence. \n\nShe said: \"Ironically, given the scaremongering about our European Union membership during the independence referendum, if we find ourselves being taken out of Europe against our will I think it is beyond any doubt that people will at least want to consider again the question of independence.\" \n\nMs Sturgeon added: \"I've always believed that Scotland will become an independent country so there's no change in position there. I think that's the direction of travel we're on. But that's my opinion, I'm one person, one politician. \n\n\"Whether I end up being proved right or wrong will be down to what the majority of people in Scotland decide.\" \n\nMs Sturgeon has also revealed that she will only hold another referendum once she is satisfied \"there is support in Scotland for independence that means that referendum is going to be successful\".\n\nScottish broadcaster STV is screening a one-hour documentary entitled Scotland, What Next? tomorrow night featuring new interviews with many of the major players in the independence referendum campaign. \n\nMs Sturgeon told STV: \"I don't ever want to feel what I felt in the early hours of September 19. \n\n\"Immediately afterwards, the mood was one of utter devastation and I felt that personally. We were all grief-stricken. \n\n\"If we are going to have another independence referendum I want to know there is support in Scotland for independence that means that referendum is going to be successful.\" \n\nBetter Together leader Alistair Darling has warned that the Tories' plan for English votes for English laws (Evel) could be \"fatal\" for the union. \n\nHe has also slated nationalists for perpetuating the divisions that emerged during the referendum campaign. \n\n\"Evel is a piece of nonsense and it should be rejected,\" he told STV. \n\n\"It doesn't work and will never work... we need to get it right... otherwise the consequences will be fatal.\" \n\nHe added: \"I have never come across some of the divisions (seen during the referendum), amongst friends, amongst family, people saying things to each other that I would have thought unbelievable. \n\n\"I think that it is corrosive, it won't go away - this is not something you can easily fix and it's almost being encouraged by the nationalists - this idea that if you're not for them you're against Scotland. \n\n\"Half the population didn't vote for them, and a country that is divided from top to bottom where you've got these divisions, which you do see day in, day out, it is very, very, very bad for Scotland.\" \n\nScottish Conservative leader Ruth Davidson said: \"Nicola Sturgeon has now made it clear that she wants to take Scotland back to another referendum, with all the uncertainty and division that entails. \n\n\"This is despite the fact that only last year she promised Scots that last year's referendum would be once in a generation. As polling shows this weekend, another referendum also flies in the face of public opinion.\n\n\"Most people in Scotland want to put last year's referendum behind them and get on with life. Despite her own promises, it is now clear that Nicola Sturgeon wants to take Scotland back to a neverendum.\n\n\"This SNP has shown yet again that it will always put its obsession with separation first. It is time for an alternative to this arrogant SNP administration and the Scottish Conservatives are determined to provide it.\"\n\nScottish Liberal Democrat leader Willie Rennie said: \"People who regretted the divisive nature of referendum and thought that democracy counted will be disappointed that Nicola Sturgeon is putting another referendum as a priority in her manifesto. \n\n\"A year after she promised us that it would be a once-in-a-lifetime event she is now putting her party first before the country by plunging us into another protracted campaign for independence.\n\n\"With the police in crisis, the NHS in difficulty and educational standards slipping, we need a government focused on the challenges in our daily lives rather than their own political ideology.\"\n\nLabour's Shadow Scottish secretary Ian Murray said: \"While Labour is facing the future with new leaders who have an overwhelming mandate for change, the SNP are stuck in the arguments of the past. \n\n\"T he SNP want the next election to be about the past arguments on independence because they can't defend their record in government. \n\n\"We will be talking about Scotland's future: the children and young people who are leaving school or going into work without the education and skills they need to succeed.\"", "source": "Brechin Advertiser"}