{"published": "2015-09-20T07:00:00Z", "media-type": "News", "title": "Rugby World Cup 2015: Stopping Fiji's giant - the Wallabies plan for Nemani Nadolo", "id": "d766c709-9f89-441c-b8d3-32c18c2b8bfa", "content": "How do you stop a 130 kilogram giant who can eat two whole chickens by himself at one pre-World Cup dinner? \n\nBATH: How do you stop a 130 kilogram giant who can eat two whole chickens by himself at one pre-World Cup dinner?\n\nIt sounds like the Wallabies' mission impossible, but prop Sekope Kepu says they will rely on trust and limiting possession to nullify the impact of Fiji's \"voice\" Nemani Nadolo. in the biggest upset in World Cup history on Saturday (Sunday morning AEST).\n\nThe result will give Fiji a major boost as Nadolo shoulders their hopes of writing their own history when they play the Wallabies in Cardiff on Wednesday (Thursday 1.45am AEST).\n\nThe imposing 195 centimetre winger is Fiji's try-scoring weapon, big-hitting defender, goal-kicker and inspirational leader.\n\nThe problem comes when opponents try to stop the runaway wrecking ball.\n\nAnd after seeing Nadolo's transition from unwanted NSW Waratah to international force, Kepu says the Wallabies will have to muscle up to halt his charge.\n\n\"We played at Randwick together, I look back and he was always that player,\" Kepu said.\n\n\"It's just unfortunate that [then coaches] Chris Hickey and Michael Foley didn't want him [at the Waratahs].\n\n\"He's always been that kind of player with X-factor – a big boy with a lot of skill. He's one to watch and we've got systems to try to nullify his game and put him under a bit of heat.\"\n\nNadolo is the one who got away from the Waratahs after he dropped out of the NSW system and pursued a career overseas.\n\nHe returned to Super Rugby with the Canterbury Crusaders and has excelled as one of the most powerful wingers in world rugby.\n\nHe has taken on more responsibility as one of Fiji's leaders as they aim to make the Wallabies sweat in the pool stages.\n\nOf course, the Wallabies have more to worry about than Nadolo, with Fiji possessing unpredictable attacking weapons across the field.\n\nLock Will Skelton admits it would be silly to \"put all of our eggs in one basket\" and focus on shutting Nadolo down.\n\nBut it's no secret that Nadolo is the key man on the field.\n\n\"He's become a bit of a voice for them, that's a credit to him,\" Kepu said.\n\n\"[Nadolo] is a big guy and if you don't look after him, you lose two or three players trying to stop him as you saw in the England game.\n\n\"If we can stop the ball getting out to him and make him come in and look for it, those are the other options you can do. We'll sharpen up and get everything down pat.\"\n\nNadolo caught the attention of British journalists when he revealed he downed two chickens at Nandos in the lead-up to the World Cup opener against England.\n\nAnd the Wallabies want to make sure they're not next on the Fiji dinner list.\n\nJapan caused the first major boilover on Saturday when they beat two-time World Cup-winners South Africa.\n\nIt was Japan's first win at the World Cup in 24 years and players broke down in tears after what is widely regarded as the biggest upset in the tournament's history.\n\nJapan coach Eddie Jones described it as a \"miracle\" while South Africa skipper Jean De Villiers said he was embarrassed and coach Heyneker Meyer apologised to the Rainbow Nation.\n\nThe chance to beat a top-tier nation drives the minnows at the World Cup, but Kepu said the Wallabies would not fall into the trap of taking Fiji lightly.\n\n\"You don't take any team lightly in the World Cup. Teams are passionate about their country and knowing it's the pinnacle of rugby, everything you put out there, there's millions and millions of people watching,\" Kepu said.\n\n\"You just want to do your best for your country and not let anyone down … they're becoming more and more of a threat.\n\n\"There's no better challenge to get them, they're a step ahead. They've played one game and have that match fitness.\" The story first appeared on The Sydney Morning Herald.", "source": "Wellington Times"}