{"published": "2015-09-02T06:48:00Z", "media-type": "News", "title": "TOUMAZ LD : Colour screen solution enhances new Frontier DAB technology", "id": "3512af0f-828e-4330-a42e-03c01963c6cd", "content": "02/09/15  Colour screen solution enhances new Frontier DAB technology  \nLondon, 2nd September 2015 \n \nFrontier Silicon announces that its recently launched Verona 2 module now supports colour screen displays for DAB / DAB+ digital radios. \n \n The Verona 2 module, based on the company's Kino 4 system-on-chip, has received a firmware upgrade which allows manufacturers to add colour screen capability to audio devices - using a single, integrated technology solution.  \n \n This development allows manufacturers to benefit from:  \n Lower unit costs - no need for additional hardware  Shorter development times - Verona 2 is a turn-key solution and many customers will be able to re-use existing product designs  Improved power efficiency - optimised chip set using a single integrated processor solution  \n DAB Slideshow, the technology which allows radio stations to broadcast colour images to complement their audio services, is a core part of this upgrade for Verona 2.  For the first time, devices which can display these images will be available at mass market prices.  Products based on this technology will be available in the market early next year.  \n \nPrem Rajalingham, Vice-President, Sales and Marketing, Frontier Silicon , said:  \n \n \"Until now, colour screens have been the preserve of premium digital receivers, limiting broadcasters' ability to reach listeners with their DAB Slideshow services. Next year will see a new range of mass market receivers with colour capabilities hitting the retail shelves, bringing a step change to the digital radio market.\"  \n \n Frontier Silicon will demonstrate Verona 2 with colour user interface and DAB slideshow at IFA 2015 next week.  \n \n Examples of DAB Slideshow  \n \nAbout Frontier Silicon Limited \n \nFrontier Silicon is the world's leading supplier of integrated circuits and modules for digital radio and connected audio products.  The company is part of the Toumaz Group, a pioneer in low-power wireless semiconductor and software technologies for consumer audio and wireless healthcare. \n \nFrontier Silicon's audio products offer solutions for DAB/DAB+, Internet Radio and Connected Audio - from silicon through software to production-ready platform designs.  Customers supplied by Frontier Silicon include Bose, Denon, Grundig, harman/kardon, Onkyo, Panasonic, Philips, Pioneer, Pure, Roberts, Sony, TechniSat, Yamaha, and many more. \n \n Frontier Silicon is a trademark or registered trademark of Frontier Silicon Ltd.  \n \nContact details \n \nFrontier Silicon \n \nPrem Rajalingham, Vice-President, Sales and Marketing", "source": "4 Traders"}