{"published": "2015-09-17T14:01:50Z", "media-type": "News", "title": "As drones gain popularity, the UK and NASA plan to develop a UAV tracking system", "id": "53039d6d-dc9f-4f26-b4a0-17b0acc0806f", "content": "U.K. lawmakers want to track the consumer and commercial use of drones and they're turning to NASA for help, reports the New York Times. Under Secretary of State for Transport Lord Ahmad Tariq confirmed that the country is discussing the idea of a drone traffic management system with the U.S. space agency. The idea for a civilian drone traffic management system is part of a larger initiative in the U.K. to regulate drone usage, which is poised to explode in the coming years. \n\nThe U.K. is interested in developing and testing a tracking system that would allow officials to monitor all civilian drones flying at low altitudes (under 500 feet). The system may require drone operators to register their flight plans and follow a set of rules similar to those already in place for managing automobile traffic. Once in flight, the drone would be tracked possibly using the existing cell phone infrastructure as it moved along its route. Drone operators concerned about major changes to their hobby can rest easy for now as NASA is not expected to have a working prototype traffic management system in place until 2019. \n\nRelated: UK drone pilot punished for flights over pro soccer games and London landmarks \n\nThough a traffic system is still a few years away, U.K. lawmakers are pushing forward with other strategies to ensure safety as drones begin to clog the skies. Earlier this year, lawmakers published a report proposing a wide range of safety rules that would oversee the growing number of UAVs taking to the skies for both personal and professional use. The proposal includes a licensing or registration system that would require all drone operators to register their drones before they would be allowed to fly them. This database would be available online and possibly even tied to a smartphone app that would enable citizens to identify the owner of a drone flying overhead. Other proposals include the expanded use of geo-fencing to keep drones away from certain locations, such as airports and jails, where drone presence is not permitted. \n\nThe U.K. is not the only country concerned about the explosion in drone operation that is predicted for the next decade. NASA also is working with U.S. government and companies like Verizon, Google, and Amazon on a similar traffic management system in the U.S. Both government and industry entities are exploring whether cell phone towers could be used for the surveillance of unmanned aerial vehicles. Besides surveillance, the plan would provide geo-fencing for no-fly zones, navigation guidance to avoid mid-air collisions, and even a grounding system that would halt drone traffic in severe weather conditions. Similar to the U.K. proposal, NASA expects to have prototype system in place by 2", "source": "DailyNews724.com"}