{"published": "2015-09-04T02:57:58Z", "media-type": "News", "title": "10-year-old boy shot in West Baltimore", "id": "9ebc9dfd-adb5-43e9-aba2-43721cb7347f", "content": "Three people — including a 10-year-old boy — were shot Thursday night on North Avenue near Ellamont Street in Walbrook, West Baltimore, police said. None of the injuries were life-threatening, police said. \n \nPolice said they believe at least two persons are responsible and that the 10-year-old boy was not targeted. No other information was immediately available. \n\nThe shootings follow several others Thursday, including one fatal. \n\nOne man was shot to death in South Baltimore on Thursday afternoon, and two people were shot in the morning, police said. \n\nThe homicide occurred about 4:30 p.m. at Ninth and East Jeffrey streets in Brooklyn, police said. The man was found with a gunshot wound to his back and taken to a hospital, where he died. \n\nA car crash in the nearby 3600 block of St. Victor St. might have been related, police said, but whether the vehicle was used by a suspect or suspects was unclear. \n\nPolice said they detained at least one person of interest in the shooting. \n\nA teenager was among two shot earlier Thursday. \n  \nJust before 9 a.m. Thursday, police found a 17-year-old male in the 200 block of Mason Court in East Baltimore with gunshot wounds to his back and foot. The victim was taken to an area hospital for treatment. Investigators said they think the shooting happened in the 200 block of Bethel Court. \n\nAt 1:20 a.m., officers found a 32-year-old Baltimore man shot in the upper body in the 3000 block of Wylie Ave. in Parklane in Northwest Baltimore. The victim was taken to an area hospital, where he was listed in critical condition but is expected to survive, police said. \n\nThree people were shot in the city Wednesday. \n \nPolice called to the 4600 block of Mannasota Ave. in Northeast Baltimore's Frankford neighborhood about 6:45 p.m. found a 20-year-old man who had been shot in the back and lower body. The victim told officers he was shot by an unknown person in the 4400 block of St. Thomas Ave. He was taken to a hospital and is expected to survive, police said. \n\nTwo men, 19 and 27, were shot about 3 p.m. Wednesday in the 3300 block of W. Lexington St., police said. Both had gunshot wounds to the lower body and were taken to hospitals, police said. Their conditions were unknown. \n\nEarly Tuesday morning, a 29-year-old man walked into a hospital with a gunshot wound to the upper body, police said. He told responding officers he had been shot in the 4200 block of Glenarm Ave. in Northeast Baltimore's Cedmont neighborhood, police said. The unidentified victim is expected to survive. \n\nNo suspects or motives have been identified in any of the cases, police said. \n\nPolice asked anyone with information about the shootings to call Metro Crime Stoppers at 1-866-7LOCKUP. \n Copyright © 2015, The Baltimore Sun", "source": "Baltimore Sun"}