{"epi0Bauqu": ["Thanks Andrew -- appreciate it! I shudder to think of all the things I posted 8 years ago :).", "It is not only useful on our platform. The entire instant answer engine is open source as well, and could be incorporated in any program. Additionally, much of our Instant Answers are freely accessible via our API: <a href=\"https:&#x2F;&#x2F;duckduckgo.com&#x2F;api\" rel=\"nofollow\">https:&#x2F;&#x2F;duckduckgo.com&#x2F;api</a>. These could be and are incorporated in other programs. We are looking for ways to expand access and make them more useful, and would appreciate any suggestions.<p>That said, there are many for-profit companies that create and maintain open source projects that are primarily used for them. While that may mean that many people aren&#x27;t interested in developing for them, it doesn&#x27;t mean everyone isn&#x27;t. There are some people who want to improve their own search results. There are some people who just want to help a private alternative in search.<p>There are others who would like exposure on our search engine pages (for their APIs or via developer attribution). In fact, as we get a decent amount of traffic now, that exposure has real monetary value. We place Instant Answers above ads and links, and so the sources that are used for Instant Answers are monetarily benefiting through their inclusion in the ecosystem. In any case, there are many valid reasons why someone may want to develop on DuckDuckHack.", "We would <i>love</i> your help: <a href=\"http:&#x2F;&#x2F;duckduckhack.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;duckduckhack.com&#x2F;</a><p>DuckDuckHack (that link) is our instant answer platform and it is all open source (both the answers themselves and the underlying answer engine). We believe that each programming area (MySQL, Perl, React, etc.) can be best served by a group of Instant Answers, and only developers with expertise in those areas can craft the best experiences for that set of Instant Answers.<p>As a small team, we therefore need help in our goal of making DuckDuckGo the best search engine for developers.", "DuckDuckGo - Remote<p><a href=\"https:&#x2F;&#x2F;duck.co&#x2F;help&#x2F;company&#x2F;hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;duck.co&#x2F;help&#x2F;company&#x2F;hiring</a>", "Thanks! I would too love to spread those stories to new audiences. We are really trying to branch out beyond the startup world but are honestly new to it and unsure so far what will work. So any ideas from you or anyone would be appreciated! Open to try almost anything :). Also, unjust sent you a DM on Twitter about a related matter.", "It more doesn&#x27;t work for our privacy policy since we don&#x27;t track users.", "I&#x27;m not sure if we improved for Greek in particular yet but this generally (non English) has been a focus recently so it should really be improving. I&#x27;d be curious if you notice any improvement and if the region toggle does anything for you.", "We&#x27;d love to become the default search wherever we can!", "Oh man, double face palm :)<p>I would go around to local meetup groups here in Philly and continually show it to people, as well as friends and family.", "These interviews (I referenced above) were really the first things I did: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;tractionbook\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;tractionbook</a><p>I blogged all of them on Hacker News (you can search the archives to see), and then started blogging ideas that would become the book and got feedback from those on my blog and on HN.<p>This was all before really writing. Once we actually started writing we recruited &quot;early readers&quot; periodically to read and give feedback up until we had a full draft more ready to go, in which case we hit up our whole list and got another round of fresh-eyes feedback."]}